#第三题


# a = """
# 文能提笔安天下，
# 武能上马定乾坤，
# 心存谋略和人生，
# 古今英雄唯使君。
# """
# print(a)



# 第五题


# mun = input("请输入一个数字：")
# mun = int(input("请输入一个数字："))
# if mun > 66:
	# print("猜测的结果大了")
# elif mun < 66:
	# print("猜测的结果小了")
# else:
	# print("猜测结果正确")
	

	
# 第六题


# age = int(input("请输入年龄："))
# if age > 90:
	# print("再见了这个世界")
# elif age > 70:
	# print("人生就快结束了的一个老屁孩儿")
# elif age > 60:
	# print("活着还不错的老屁孩")
# elif age > 50:
	# print("自己马上变成不听话的老屁孩儿")
# elif age > 40:
	# print("家里有个不听话的小屁孩儿")
# elif age > 30:
	# print("看老大不小了，赶紧结婚小屁孩儿")
# elif age > 20:
	# print("开始定性，开始混社会的小屁孩儿")
# elif age > 10:
	# print("青春叛逆期的小屁孩儿")
# else:
	# print("小屁孩")
	
	
	

# 第八题


# text = input("请输入马化腾：")

# if text == "马化腾":
	# print("你真聪明")
# else:
	# print("你是傻逼吗？")

	


	
# 第九题



# month = input("请输入想查询的的月份")

# if month == "一月":
	# print("研究资料表明，葡萄中海油丰富的白藜芦醇，尤其是紫葡萄或者红葡萄。白藜芦醇具有强大的抗氧化和抗炎功效，他可以阻碍细胞癌变的症状。")
# elif month == "二月":
	# print("番茄的番茄红素还是番茄中其他一些物质能够起到抗癌的作用现在还不清楚，但食用番茄可以降低多种癌症的发病风险。")
# elif month == "三月":
	# print("我们都知道蔬菜水果中是最具有丰富的维生素及纤维的食物，里面也含有丰富的抗癌物质，而研究表明色彩越鲜艳，营养物质也就越丰富。")
# elif month == "四月":
	# print("一般的烤肠等还不会伤害到你。但是加工肉制品(如腊肠，火腿和热狗)可以提高结直肠癌和胃癌的发病风险。同时，熏制和腌制的肉制品中的潜在致癌物质将增加癌症的发病风险。")
# elif month == "五月":
	# print("根据美国癌症协会，获得叶酸的最好方法不是通过药丸，而应在平时饮食中增加水果蔬菜和强化的谷物制品的摄入。比如：鸡胗，豆类，葵花籽和绿叶蔬菜等。")
# elif month == "六月":
	# print("茶被公认为具有强效抗癌作用的饮品，尤其是绿茶。以实验室研究表明，绿茶可以防止和减缓食管，肝，乳房还有前列腺内癌细胞的生长。还有其他一些长期的研究表明，茶和降低膀胱癌，胃癌和胰腺癌的发病率有关。")
# elif month == "七月":
	# print("水不只是可以用来解渴，它还能保护你以避免患上膀胱癌。它通过稀释膀胱中潜在的致癌物质起到保护作用。同时喝更多的液体，可以增加你的排尿量，这样就减少了致癌物质与膀胱内膜的接触时间，同样起到了保护作用。 ")


	




# 第十题



# score = int(input("请输入你的分数："))
# if score >= 90:
	# print("A")
# elif score >= 80:
	# print("B")
# elif score >= 70:
	# print("C")
# elif score >= 60:
	# print("D")
# else:
	# print("E")
